
export const simpleDomains = [
  {
    domain: "Self-care",
    items: [
      {
        id: "feeding",
        name: "1. 食べること・飲むこと",
        options: [
          [0, "点滴や栄養のための管が必要"],
          [0, "全く自分自身では不可"],
          [1, "部分的な他人の助けが必要，または補助具の付け外しに他人の助けが必要"],
          [2, "自分でできるが，補助具や食事準備に助けが必要"],
          [3, "全て自分でできる、他人の助けや補助具は不要"],
        ],
      },
      {
        id: "bathing_upper",
        name: "2A. 上半身と頭を洗う",
        description:  "石鹸でこすり，乾かし，蛇口の開け閉めをすることを含む",
        options: [
          [0, "全面的に介助が必要"],
          [1, "部分的に介助が必要"],
          [2, "自立しているが，補助具や特定の設備が必要"],
          [3, "自立しており，補助具や特定の設備は不要"],
        ],
      },
      {
        id: "bathing_lower",
        name: "2B. 下半身を洗う",
        description:  "石鹸でこすり，乾かし，蛇口の開け閉めをすることを含む",
        options: [
          [0, "全面的に介助が必要"],
          [1, "部分的に介助が必要"],
          [2, "自立しているが，補助具や特定の設備が必要"],
          [3, "自立しており，補助具や特定の設備は不要"],
        ],
      },
      {
        id: "dressing_upper",
        name: "3A. 上半身の更衣",
        description:  "簡単な衣服とはボタン、ファスナー、くつひもの無い衣服。困難な衣服はそれらが有る衣服",
        options: [
          [0, "全面的に介助が必要"],
          [1, "簡単な衣服でも部分的に介助が必要"],
          [2, "簡単な衣服では介助不要だが，補助具や特定の設備が必要"],
          [3, "簡単な衣服は自立，困難な衣服のみ介助等が必要"],
          [4, "完全に自立している"],
        ],
      },
      {
        id: "dressing_lower",
        name: "3B. 下半身の更衣",
        description:  "簡単な衣服とはボタン、ファスナー、くつひもの無い衣服。困難な衣服はそれらが有る衣服",
        options: [
          [0, "全面的に介助が必要"],
          [1, "簡単な衣服でも部分的に介助が必要"],
          [2, "簡単な衣服では介助不要だが，補助具や特定の設備が必要"],
          [3, "簡単な衣服は自立，困難な衣服のみ介助等が必要"],
          [4, "完全に自立している"],
        ],
      },
      {
        id: "grooming",
        name: "4. 身づくろい",
        description:  "手洗い、洗顔、歯磨き、整髪、髭剃り、化粧を含む",
        options: [
          [0, "全く自分自身では不可"],
          [1, "部分的な他人の助けが必要"],
          [2, "補助具があれば自分でできる"],
          [3, "補助具がなくても自分でできる"],
        ],
      },
    ],
  },
  {
    domain: "Respiration and sphincter management",
    items: [
      {
        id: "toilet",
        name: "8. トイレの使用",
        description:  "陰部の清潔、手洗い、下衣脱着、簡単な衣服、パッドやオムツの処理を含む",

        options: [
          [0, "全く自分自身では不可"],
          [1, "部分的な他人の助けが必要で，自分で陰部を拭くのは不可"],
          [2, "部分的な他人の助けが必要で，自分で陰部を拭ける"],
          [4, "他人の助けは不要だが，補助具(手すり等)または特別な環境(車椅子対応トイレ等)が必要"],
          [5, "他人の助けも補助具も特別な環境も不要"],
        ],
      },
    ],
  },
  {
    domain: "Mobility",
    items: [
      {
        id: "bed_mobility",
        name: "9. ベッド上動作・除圧",
        description:  "４つのうちいくつできますか　①ベッド上で上半身の向きを変える　②ベッド上で下半身の向きを変える　③起き上がる　④車椅子上でのプッシュアップ(補助具要否問わず)",
        options: [
          [0, "なし，全ての動作に介助が必要"],
          [2, "1個できる"],
          [4, "2〜3個できる"],
          [6, "全てできる"],
        ],
      },
      {
        id: "bed_to_wheelchair",
        name: "10. ベッドから車椅子への乗り移り",
        options: [
          [0, "全面的に介助が必要"],
          [1, "部分的に介助や見守りや補助具(トランスファーボード等)が必要"],
          [2, "介助も補助具も不要"],
          [2, "車椅子は使用しない"],
        ],
      },
      {
        id: "wheelchair_to_toilet",
        name: "11. 車椅子からトイレや浴槽への乗り移り",
        options: [
          [0, "全く自分自身では不可"],
          [1, "部分的な他人の助けや見守りや補助具(手すり等)が必要"],
          [2, "他人の助けも補助具も不要"],
          [2, "車椅子は使用しない"],
        ],
      },
      {
        id: "stairs",
        name: "15. 階段昇降",
        options: [
          [0, "不能"],
          [1, "3段以上可能だが，他人の助けや見守りが必要"],
          [2, "3段以上可能だが，補助具(手すり、杖等)が必要"],
          [3, "3段以上可能で，他人の助けや見守り、補助具は不要"],
        ],
      },
      {
        id: "wheelchair_to_car",
        name: "16. 車椅子から車への乗り移り",
        description:  "乗り移りは車椅子の車への積み下ろしも含む",
        options: [
          [0, "全面的に介助が必要"],
          [1, "部分的に介助や見守りや補助具が必要"],
          [2, "介助も補助具も不要"],
          [2, "車椅子は使用しない"],
        ],
      },
      {
        id: "ground_to_wheelchair",
        name: "17. 床から車椅子への乗り移り",
        options: [
          [0, "他人の助けが必要"],
          [1, "他人の助けは不要"],
          [1, "車椅子は使用しない"],
        ],
      },
    ],
  },
];
